Repository: issam-elajraoui/CaminoFrontEnd
Catalog: CaminoTestSwiftUI/*.lproj/Localizable.strings
Languages: fr

# title
source: Location Access Required
fr: Accès à la localisation requis

# subtitle
source: To find nearby drivers
fr: Pour trouver des conducteurs à proximité

# feature1Title
source: Find nearby drivers
fr: Trouver des conducteurs

# feature1Desc
source: We need your location to match you with available drivers in your area
fr: Nous avons besoin de votre localisation pour vous connecter avec des conducteurs disponibles dans votre région

# feature2Title
source: Accurate pickup
fr: Prise en charge précise

# feature2Desc
source: Your location helps us provide precise pickup coordinates
fr: Votre localisation nous aide à fournir des coordonnées de prise en charge précises

# feature3Title
source: Privacy protected
fr: Confidentialité protégée

# feature3Desc
source: Your location is only used during ride booking and never stored permanently
fr: Votre localisation n'est utilisée que pendant la réservation et jamais stockée de façon permanente

# allowLocation
source: Allow Location Access
fr: Autoriser la localisation

source: Open Settings
fr: Ouvrir les paramètres

source: Continue
fr: Continuer

source: Cancel
fr: Annuler

# findRide
source: Find a Ride
fr: Trouver une course

source: Pickup Location
fr: Lieu de départ

source: Passengers
fr: Passagers

# economy
source: Eco
fr: Éco

source: Searching...
fr: Recherche...

source: Find Drivers
fr: Chercher

# estimatedFare
source: Est. Fare
fr: Tarif est.

# pickupRequired
source: Pickup location required
fr: Lieu de départ requis

source: Destination required
fr: Destination requise

# noDriversFound
source: No drivers available
fr: Aucun conducteur disponible

# searchError
source: Search failed
fr: Erreur de recherche

source: Location error
fr: Erreur de localisation

source: Address not found
fr: Adresse introuvable

source: Invalid address
fr: Adresse invalide

source: Invalid location
fr: Position invalide

# error.permissionDenied
source: Location permission denied
fr: Permission de localisation refusée

# error.locationDisabled
source: Location services disabled
fr: Services de localisation désactivés

# error.geocodingFailed
source: Address not found
fr: Adresse introuvable

# error.invalidAddress
source: Invalid address
fr: Adresse invalide

# error.outsideServiceArea
source: Address outside service area
fr: Adresse hors zone de service

# error.timeout
source: Location request timeout
fr: Délai de localisation dépassé

# error.unknown
source: Location error
fr: Erreur de localisation

# rideError.networkError
source: Network connection failed
fr: Échec de la connexion réseau

# rideError.timeout
source: Search timeout
fr: Délai de recherche dépassé

# rideError.noDriversFound
source: No drivers available in your area
fr: Aucun conducteur disponible dans votre région

# rideError.invalidLocation
source: Invalid pickup or destination
fr: Lieu de départ ou destination invalide

# rideError.serviceUnavailable
source: Service temporarily unavailable
fr: Service temporairement indisponible

# rideError.unknown
source: Service temporarily unavailable
fr: Service temporairement indisponible

# gpsDisabled
source: No GPS
fr: Pas de GPS

# enableGpsMessage
source: Enable GPS for better location services
fr: Activez le GPS pour de meilleurs services de localisation

# enableGps
source: Enable
fr: Activer

source: Current Location
fr: Position actuelle

# tapToCustomize
source: Long press to customize
fr: Appui long pour modifier

source: Using GPS location
fr: Position GPS utilisée

source: Custom pickup enabled
fr: Départ personnalisé activé

# searchMode
source: Search
fr: Recherche

# pinpointMode
source: On map
fr: Sur la carte

source: Select on map
fr: Choisir sur la carte

source: Confirm location
fr: Confirmer la position

# resolvingAddress
source: Finding address...
fr: Recherche de l'adresse...

source: Drag map to choose
fr: Déplacez la carte pour choisir

source: Available
fr: Disponible

source: Busy
fr: Occupé
